<template>
  <default-page
    title="Обо мне"
    image="/images/pages/about.jpg"
    prev="/contacts"
    next="/"
  >
    <v-row>
      <v-col class="col-12 col-6 col-md-3">
        <v-img
          width="100%"
          lazy-src="/images/personal/photo.jpg"
          src="/images/personal/photo.jpg"
        ></v-img>
      </v-col>
      <v-col class="col-12 col-sm-6 col-md-9">
        <h1 class="title">Евченко Максим Николаевич</h1>
        <p class="subtitle-1">Front-end Developer</p>
        <h2 class="my-4">Начало</h2>
        <p class="text-justify">
          Мой карьерный рост начался с работы на телевидении в рекламном отделе.
          Я работал дизайнером рекламных продуктов. В один прекрасный момент
          нашему рекламному агентству понадобилось сделать сайт с этого и
          началось мое знакомство с программированием и веб-разработкой. Мы
          создали сайт на Wordpress и после этого решили добавить услугу по
          созданию сайтов для наших клиентов. Но это было только начало. Я начал
          изучать веб-разработку и языки программирования познакомился с PHP,
          CSS, и Javascript. Чем больше я изучал тем больше понимал что писать
          сайты на готовых движках или нативных языках это не практично и не
          гибко. Нужно изучать фреймворки первый из таких был Laravel.
        </p>
        <h2 class="my-4">Vue.js</h2>
        <p class="text-justify">
          Затем когда в Laravel добавили Vue.js я был в восторге от его
          возможностей и решил поменять свое направление на Front-End. Изучая
          Vue.js я познакомился и с Node.js технологией и углубился в изучение
          JavaScript и всех его нововведений. Со всеми технологиями
          веб-разработки описанными в разделе Знания технологий я познакомился в
          процессе решения задач на моем пути и накоплении опыта. Он весь
          расписан по годам в разделе Опыт работы.
        </p>
        <h2 class="my-4">Что дальше?</h2>
        <p class="text-justify">
          Как и Интернет который не стоит на месте так и я спешу за ним и
          стараюсь изучать новое и совершенствоваться.
        </p>
      </v-col>
    </v-row>
  </default-page>
</template>

<script>
export default {
  name: "AboutPage",
};
</script>
